"""Свяжите переменную с любой строкой, состоящей не менее чем из 15 символов.
Извлеките из строки первый символ
Извлеките из строки последний символ
Извлеките из строки третий с начала
Извлеките из строки третий с конца
Измерьте длину вашей строки
Переверните строку
Извлеките первые восемь символов
"""

simple_str = "Мама мыла раму!"

print(simple_str[0])
print(simple_str[-1])
print(simple_str[2])
print(simple_str[-3])
print(len(simple_str))
print(''.join(reversed(simple_str)))
print(simple_str[:8])
