"""Напишите 2 функции:
Которая запрашивает у пользователя число и выводит его квадрат
Которая запрашивает у пользователя число и определяет, является ли оно четным или нечетным
"""


def square():
    num = int(input('Введите число: '))
    return num ** 2


def is_even():
    num = int(input('Введите число: '))
    if num % 2 == 0:
        return f'Число четное'
    return f'Число нечетное'


print(square())
print(is_even())
